/*
 * Copyright (c) 2022 대진기술정보(주) All Rights Reserved
 */

package kr.djgis.sspfs.ui.feature

object Const {
    val IMAGE_PRESET_A = listOf(
        "전경",
        "주변현황",
        "상류구간현황",
        "하류구간현황",
        "부분파손균열현황",
        "철근노출부식현황",
        "교각교대세굴피해현황",
        "날개벽현황",
        "",
    )

    val IMAGE_PRESET_B = listOf(
        "시점부전경",
        "시점부세부현황",
        "중앙부전경",
        "중앙부세부현황",
        "종점부전경",
        "종점부세부현황",
        "피해시영향범위현황",
        "주택마을인접도현황",
        "",
    )

    val IMAGE_PRESET_C = listOf(
        "전경",
        "주변현황",
        "구조물정면",
        "구조물평면",
        "구조물상류방향현황",
        "구주몰하류방향현황",
        "어도현황",
        "기계장치수문현황",
        "",
    )

    val IMAGE_PRESET_D = listOf(
        "전경",
        "주변현황",
        "구조물정면",
        "구조물평면",
        "구조물상류방향현황",
        "구주몰하류방향현황",
        "어도현황",
        "기계장치수문현황",
        "",
    )

    val IMAGE_PRESET_E = listOf(
        "시점부전경",
        "시점부세부현황",
        "중앙부전경",
        "중앙부세부현황",
        "종점부전경",
        "종점부세부현황",
        "단절시영향범위현황",
        "주택마을인접도현황",
        ","
    )

    val IMAGE_PRESET_F = listOf(
        "시점부전경",
        "시점부세부현황",
        "중앙부전경",
        "중앙부세부현황",
        "종점부전경",
        "종점부세부현황",
        "단절시영향범위현황",
        "주택마을인접도현황",
        ","
    )
}
